pascal-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/inductionBlock3D/system/region_fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                               none;

    ddt(rho,U)                            backward;
// TODO
    ddt(U)                                backward;

    ddt(k)                                backward;
    ddt(omega)                            backward;
    ddt(epsilon)                          backward;
    ddt(nuTilda)                          backward;
}

gradSchemes
{
    default                               none;

    grad(U)                               Gauss linear;
    grad(p)                               Gauss linear;

    grad(k)                               Gauss linear;
    grad(omega)                           Gauss linear;
    grad(epsilon)                         Gauss linear;
    grad(nuTilda)                         Gauss linear;

    grad(cellMotionU)                     Gauss linear;
}

divSchemes
{
    default                               none;

    div(phi,U)                            Gauss GammaVDC 0.5;
    div((mu*dev(grad(U).T())))            Gauss linear;
    div((muEff*dev(grad(U).T())))         Gauss linear;

    div(phi,k)                            Gauss Gamma 0.5;
    div(phi,epsilon)                      Gauss Gamma 0.5;
    div(phi,omega)                        Gauss Gamma 0.5;
    div(phi,nuTilda)                      Gauss Gamma 0.5;

    // Up
    div(U)                                Gauss linear;
}

laplacianSchemes
{
    default                               none;

    laplacian(mu,U)                       Gauss linear corrected;
    laplacian(muEff,U)                    Gauss linear corrected;
    laplacian(rAUf,p)                     Gauss linear corrected;
//     laplacian(rAUf,p)                     Gauss linear limited 0.5;
//     laplacian(rAUf,p)                     Gauss linear limited 0.3333;

    laplacian(DkEff,k)                    Gauss linear corrected;
    laplacian(DomegaEff,omega)            Gauss linear corrected;
    laplacian(DepsilonEff,epsilon)        Gauss linear corrected;
    laplacian(DnuTildaEff,nuTilda)        Gauss linear corrected;

    laplacian(diffusivity,cellMotionU)    Gauss linear corrected;
}

interpolationSchemes
{
    default                               none;

    interpolate(rho)                      linear;
    interpolate(U)                        linear;
    interpolate(rAU)                      linear;
    interpolate(HbyA)                     linear;
    interpolate(F)                        linear;

    interpolate(grad(U))                  linear;
    interpolate(grad(p))                  linear;

    interpolate(grad(k))                  linear;
    interpolate(grad(epsilon))            linear;
    interpolate(grad(omega))              linear;

    interpolate(y)                        linear;
    interpolate(grad(cellMotionU))        linear;
}

fluxRequired
{
    p;
}

// ************************************************************************* //
