pascal-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/inductionBlock3D/system/region_buffer/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellMotionU
//     {
//         solver                   PCG;
//         tolerance                1e-09;
//         relTol                   1e-03;
//         preconditioner           DIC;
//     }
    {
        solver                   GAMG;
        tolerance                1e-09;
        relTol                   1e-03;
        smoother                 DICGaussSeidel;
        nPreSweeps               0;
        nPostSweeps              2;
        cacheAgglomeration       on;
        agglomerator             faceAreaPair;
        nCellsInCoarsestLevel    200;
        mergeLevels              1;
    }
}

// ************************************************************************* //
